Revit 2027 API
ExportLinetypeTable.GetKeys Method
 Gets all the keys stored in the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ExportLinetypeKey> GetKeys()
Public Function GetKeys As IList(Of ExportLinetypeKey)
public:
IList<ExportLinetypeKey^>^ GetKeys()
member GetKeys : unit -> IList<ExportLinetypeKey>
Return Value
IList<ExportLinetypeKey>
 The keys.
See Also
Reference
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace